# **Pivot Table**

* Reshapes data from **long format** to **wide format**.
* Aggregates values (sum, mean, etc.) across multiple dimensions.
* Similar to Excel Pivot Table.

In [1]:
import pandas as pd

In [20]:
df=pd.DataFrame({"Days":[1,2,3,4,5,6],"Name":['Haroon','Abbas','Ali','Sara','Junaid','Hurain'],"Eng":[12,34,23,53,64,63],"Maths":[33,52,51,20,83,24],"Science":[53,45,24,64,22,74]})
df

   Days    Name  Eng  Maths  Science
0     1  Haroon   12     33       53
1     2   Abbas   34     52       45
2     3     Ali   23     51       24
3     4    Sara   53     20       64
4     5  Junaid   64     83       22
5     6  Hurain   63     24       74

## `pivot()` — **Simple reshaping**

**Basic Syntax :**
```python
df.pivot(index='row', columns='column', values='value')
```
**Work:**
* Converts long → wide
* NO aggregation
* No Duplicates
* Requires unique index–column pairs

#### **Pivot Funtion  Features**

| Parameter    | Use                                    |
| ------------ | -------------------------------------- |
| `index`      | Row grouping                           |
| `columns`    | Column grouping                        |
| `values`     | Column to aggregate                    |

In [15]:
df.pivot(index='Days',columns='Name',values=['Maths'])

     Maths
Name Abbas   Ali Haroon Hurain Junaid  Sara
Days
1      NaN   NaN   33.0    NaN    NaN   NaN
2     52.0   NaN    NaN    NaN    NaN   NaN
3      NaN  51.0    NaN    NaN    NaN   NaN
4      NaN   NaN    NaN    NaN    NaN  20.0
5      NaN   NaN    NaN    NaN   83.0   NaN
6      NaN   NaN    NaN   24.0    NaN   NaN

### ❌ When pivot() FAILS

In [17]:
# df = pd.DataFrame({
#     'Name': ['Ali','Ali'],
#     'Subject': ['Math','Math'],
#     'Marks': [80,85]
# })

# df.pivot(index='Name', columns='Subject', values='Marks')

# ❌ Error: duplicate entries, cannot reshape

## `pivot_table` — **Smart & powerful**

**Basic Syntax :**
```python
pd.pivot_table(
    df,
    index='row',
    columns='column',
    values='value',
    aggfunc='mean'
)
```
**Work :**
* Converts long → wide
* Handles duplicates
* Aggregates values (mean, sum, etc.)
* Excel-like pivot table

#### **Pivot Table Function Features**

| Parameter    | Use                                    |
| ------------ | -------------------------------------- |
| `index`      | Row grouping                           |
| `columns`    | Column grouping                        |
| `values`     | Column to aggregate                    |
| `aggfunc`    | Aggregation function (mean, sum, max…) |
| `fill_value` | Replace NaN after pivot                |

In [ ]:
df = pd.DataFrame({
    'Name': ['Ali','Ali'],
    'Subject': ['Math','Math'],
    'Marks': [80,85]
})

pd.pivot_table(df, index='Name', columns='Subject', values='Marks')

# ✔ Output: average marks = 82.5

Subject  Math
Name
Ali      82.5

In [27]:
import pandas as pd

df = pd.DataFrame({
    'Dept': ['IT','IT','HR','HR','Finance','Finance'],
    'Name': ['Ali','Ahmed','Sara','Usman','Zara','Nida'],
    'Salary': [50000,55000,60000,58000,70000,68000],
    'Experience': [2,3,5,4,7,8]
})

# Pivot table: average salary per Dept
pd.pivot_table(df, index='Dept', values='Salary', aggfunc='mean')

          Salary
Dept
Finance  69000.0
HR       59000.0
IT       52500.0